docs/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-22 Tue 09:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Controlling Positive Dynamical Biomolecular Systems</title>
<meta name="author" content="Jim Liu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Controlling Positive Dynamical Biomolecular Systems</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgca9137e">1. Background</a></li>
<li><a href="#orgc3235af">2. Getting Started</a>
<ul>
<li><a href="#orgca48202">2.1. Targeted clinical control of trauma patient coagulation through a thrombin dynamics model</a></li>
<li><a href="#orge9bfcc3">2.2. Personalized modulation of coagulation factors using a thrombin dynamics model to treat trauma-induced coagulopathy</a></li>
<li><a href="#org00e1645">2.3. Control of positive systems with an unknown state-dependent power law input delay and input saturation</a></li>
<li><a href="#orgd5daaf6">2.4. Nonlinear dynamic modeling and model predictive control of thrombin generation to treat trauma-induced coagulopathy</a></li>
</ul>
</li>
<li><a href="#orgd17b5a3">3. Notes for source code</a>
<ul>
<li><a href="#org148fc38">3.1. Personalized modulation of coagulation factors using a thrombin dynamics model to treat trauma-induced coagulopathy</a>
<ul>
<li><a href="#org3739cec">3.1.1. <code>GCM_Algorithm_for_TIC.m</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgca9137e" class="outline-2">
<h2 id="orgca9137e"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
To gain the background knowledge about our current research, please read the following paper in order.
</p>
<ol class="org-ol">
<li><a href="https:www.science.org/doi/10.1126/scitranslmed.aaf5045">Targeted clinical control of trauma patient coagulation through a thrombin dynamics model</a></li>
<li><a href="https://www.nature.com/articles/s41540-021-00202-9">Personalized modulation of coagulation factors using a thrombin dynamics model to treat trauma-induced coagulopathy</a></li>
<li><a href="https:www.sciencedirect.com/science/article/abs/pii/S0005109823000031?via%3Dihub">Control of positive systems with an unknown state-dependent power law input delay and input saturation</a></li>
<li><a href="https:onlinelibrary.wiley.com/doi/10.1002/rnc.5963">Nonlinear dynamic modeling and model predictive control of thrombin generation to treat trauma-induced coagulopathy</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgc3235af" class="outline-2">
<h2 id="orgc3235af"><span class="section-number-2">2.</span> Getting Started</h2>
<div class="outline-text-2" id="text-2">
<p>
The section severs to install or setup necessary scripts to regenerate plots in the aforementioned publications.
</p>
</div>
<div id="outline-container-orgca48202" class="outline-3">
<h3 id="orgca48202"><span class="section-number-3">2.1.</span> Targeted clinical control of trauma patient coagulation through a thrombin dynamics model</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Comming Soon&#x2026;
</p>
</div>
</div>
<div id="outline-container-orge9bfcc3" class="outline-3">
<h3 id="orge9bfcc3"><span class="section-number-3">2.2.</span> Personalized modulation of coagulation factors using a thrombin dynamics model to treat trauma-induced coagulopathy</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The source code for this paper i.e. GCM Algorithm is on our <a href="https://github.com/SYBORGS-Lab/GCM-Algorithm">SYBORG github repository</a>. There is a detailed README file, but if you want, you can follow the following instructions to get the code and necessary third-party package installed on your local machine.
</p>

<p>
The detailed notes for the source codes is available here.
</p>
</div>
</div>
<div id="outline-container-org00e1645" class="outline-3">
<h3 id="org00e1645"><span class="section-number-3">2.3.</span> Control of positive systems with an unknown state-dependent power law input delay and input saturation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Comming Soon&#x2026;
</p>
</div>
</div>
<div id="outline-container-orgd5daaf6" class="outline-3">
<h3 id="orgd5daaf6"><span class="section-number-3">2.4.</span> Nonlinear dynamic modeling and model predictive control of thrombin generation to treat trauma-induced coagulopathy</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The SimuLink model is available on our lab&rsquo;s Google Drive. Damon uploaded it to his own research ouputs folder and named the corresponding journal as &ldquo;Journal 4&rdquo;. However, the model on the drive need be converted to a &rsquo;.slx&rsquo; file. Otherwise, SimuLink cannot open it. To do this,
</p>
<ol class="org-ol">
<li>Open MATLAB</li>
<li>In MATLAB command window, navigate to this path <code>SYBORGS/Research Outputs and Project Data/Member Specific Data and Output/Damon Ghetmiri/MATLAB Codes/Journal 4/Codes/WB TEG/6 Parameters - Updated/WholeBloodTEGModel_6P_B.slx (Unzipped Files)/</code>;</li>
<li>Then, run <code>!zip -r journal4_simulink.slx '[Content_Types].xml' _rels metadata simulink</code>. You can choose your own filename, but I use <code>journal4_simulink.slx</code>. Then a slx file should be available to you.</li>
<li>To open this SimuLink Model, simply run <code>open_system('journal4_simulink.slx')</code> in the MATLAB command window.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd17b5a3" class="outline-2">
<h2 id="orgd17b5a3"><span class="section-number-2">3.</span> Notes for source code</h2>
<div class="outline-text-2" id="text-3">
<p>
These notes don&rsquo;t detail every line of the source code but provide supplementary comments, omitting certain trivial parts.
</p>
</div>
